PaymentCreateAllISPC/results/20211007/BMPaymentV17/PAYCTFORDOMOUTAX_PaymentCreate20211007151912789.txt

Status: PASS
Time Taken: 946
Size: 3908
Timestamp: Thu Oct 07 15:19:11 IST 2021
TestStep: PaymentCreate

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPayment_V1_7Service
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 4606
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v21" xmlns:urn="urn:pins.payment.edb.com:ws:paymentinitiation:v1_7" xmlns:urn1="urn:pins.payment.edb.com:domain:paymentinitiation:v1_7" xmlns:urn2="urn:pays.payment.edb.com:domain:sepa-complex-types:v5" xmlns:urn3="urn:pays.payment.edb.com:domain:debtor:v1_5" xmlns:urn4="urn:pays.payment.edb.com:domain:creditor:v1_5">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>PIN Create</wsc:Function>
         <wsc:Version>V2_0</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>27076402170</wsc:userid>
            <wsc:credentials>03110012010400425kglPboRi3h1Z4YUjUpQ0UB65Ta2kPKj1KWwkWemtrL+SoWqMxx/KuqxUVbNyTu6DsSaabKNt2t+xJppso23a37EmmmyjbdrffJeRiGWfHDGwxCWOpDYc2jgSxAz1+8eEsSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu2xJppso23a37Emmmyjbdrf8wP73CNrvpw=apG4tU0NraPbbqKUp39erKDFa7xy6z+r4VDMr/6qBlkFniGaNeDXv4cZcZZQQI6JtwB3JYQk6WqLA7oyp1FWRM6n46ehgNmHVNly8fTnQbIuGJSF2LUyGI7aE92/dgtp8jv9bsGpNe58K+xb4LeIHwjb2nVVvt4/2oLtDQ8IPJE=</wsc:credentials>
            <wsc:channel>NBA</wsc:channel>
            <wsc:orgid>4201</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>4201</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>27076402170</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item value="27076402170" key="AgreementId"/>
            <wsc:item value="768b7b1b-6238-4a89-a1f0-98e31ff7ada2" key="LogRef"/>
            <wsc:item key="PaymentChannel" value="BES"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentCreateRequest>
         <urn:paymentMessage>
            <urn1:paymentIdentification>
               <urn2:messageIdentification>4967169</urn2:messageIdentification>
               <urn2:endToEndIdentification>PAYCTFORDOMOUTAX</urn2:endToEndIdentification>
               <!--Optional:-->
            </urn1:paymentIdentification>
            <urn1:paymentInfo>
               <urn3:paymentMethod>TRF</urn3:paymentMethod>
               <!--Optional:-->
               <urn3:paymentTypeInformation>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn3:categoryPurpose>TAXS</urn3:categoryPurpose>
               </urn3:paymentTypeInformation>
               <!--You have a CHOICE of the next 2 items at this level-->
               <urn3:requestedExecutionDate>2021-10-07</urn3:requestedExecutionDate>
               <urn3:debtorAccount>
                  <urn2:identification>34950211433</urn2:identification>
                  <!--Optional:-->
                  <urn2:currency>NOK</urn2:currency>
               </urn3:debtorAccount>
               <urn3:debtorAgentBIC>SPAVNOBBXXX</urn3:debtorAgentBIC>
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
            </urn1:paymentInfo>
            <urn1:transaction>
               <urn4:amount>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <urn2:instructedAmount currency="NOK">
                     <urn2:amount>1</urn2:amount>
                  </urn2:instructedAmount>
               </urn4:amount>
               <!--Optional:-->
               <!--Optional:-->
               <urn4:chargeBearer>DEBT</urn4:chargeBearer>
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <urn4:creditorAccount>
                  <urn2:identification>63450103502</urn2:identification>
                  <!--Optional:-->
               </urn4:creditorAccount>
               <urn1:creditorScorReference>7901807251901190010</urn1:creditorScorReference>
               <!--Optional:-->
               <!--Zero or more repetitions:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
            </urn1:transaction>
            <!--Optional:-->
            <!--Optional:-->
            <!--Optional:-->
         </urn:paymentMessage>
      </urn:PaymentCreateRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 27076402170;4201;27076402170;EVRYCPS;PIN;PINSPayment_V1_7.PaymentCreate;-;768b7b1b-6238-4a89-a1f0-98e31ff7ada2;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns6:PaymentCreateResponse xmlns:ns10="urn:srv.pays.payment.fs.evry.com:ws:agreementcapture:v1_0" xmlns:ns9="urn:srv.stord.fs.evry.com:domain:common:v1" xmlns:ns8="urn:pays.payment.edb.com:domain:edb-types:v1" xmlns:ns7="urn:pays.payment.edb.com:domain:nationalinformation-nor:v1_0" xmlns:ns6="urn:pins.payment.edb.com:ws:paymentinitiation:v1_7" xmlns:ns5="urn:pays.payment.edb.com:domain:creditor:v1_5" xmlns:ns4="urn:pays.payment.edb.com:domain:sepa-complex-types:v5" xmlns:ns3="urn:pays.payment.edb.com:domain:debtor:v1_5" xmlns:ns2="urn:pins.payment.edb.com:domain:paymentinitiation:v1_7" xmlns="http://edb.com/ws/WSCommon_v21">
         <ns8:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <StrErrorCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <Message>OK</Message>
            <NativeError xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <errorItem key="6456" value="A similar payment was recently added. Make sure it is not a mistake."/>
         </ns8:ResponseState>
         <ns6:paymentResult>
            <ns2:messageId>1025552</ns2:messageId>
            <ns2:paymentInfoId>1119001</ns2:paymentInfoId>
            <ns2:transactionId>260896967</ns2:transactionId>
            <ns2:initiatorIdentifier>27076402170</ns2:initiatorIdentifier>
            <ns2:paymentReference>260896967</ns2:paymentReference>
            <ns2:releaseDate>2021-10-07+02:00</ns2:releaseDate>
            <ns2:paymentType>FOREIGN_DOMESTIC_TAX</ns2:paymentType>
            <ns2:paymentProduct>PI Domestic</ns2:paymentProduct>
            <ns2:transactionFee currency="NOK">
               <ns4:amount>25.00</ns4:amount>
            </ns2:transactionFee>
            <ns2:additionalServiceCharge>
               <ns4:serviceName>Outward OUR</ns4:serviceName>
               <ns4:charge currency="NOK">
                  <ns4:amount>2.50</ns4:amount>
               </ns4:charge>
            </ns2:additionalServiceCharge>
            <ns2:paymentIdentification>
               <ns4:messageIdentification>4967169</ns4:messageIdentification>
               <ns4:endToEndIdentification>PAYCTFORDOMOUTAX</ns4:endToEndIdentification>
            </ns2:paymentIdentification>
            <ns2:groupHeader>
               <ns4:creationDateTime>2021-10-07T11:49:11.742+02:00</ns4:creationDateTime>
            </ns2:groupHeader>
            <ns2:paymentInfo>
               <ns3:paymentMethod>TRF</ns3:paymentMethod>
               <ns3:paymentTypeInformation>
                  <ns3:instructionPriority>NORM</ns3:instructionPriority>
                  <ns3:categoryPurpose>TAXS</ns3:categoryPurpose>
               </ns3:paymentTypeInformation>
               <ns3:requestedExecutionDate>2021-10-07+02:00</ns3:requestedExecutionDate>
               <ns3:debtorAccount>
                  <ns4:identification>34950211433</ns4:identification>
                  <ns4:currency>NOK</ns4:currency>
               </ns3:debtorAccount>
               <ns3:debtorAgentBIC>SPAVNOBBXXX</ns3:debtorAgentBIC>
               <ns3:debtor>
                  <ns4:name>Amy Hallstein Walderhaug</ns4:name>
                  <ns4:postalAddress>
                     <ns4:postCode>3711</ns4:postCode>
                     <ns4:townName>SKIEN</ns4:townName>
                     <ns4:country>NO</ns4:country>
                     <ns4:addressLine>STENSLI</ns4:addressLine>
                  </ns4:postalAddress>
               </ns3:debtor>
            </ns2:paymentInfo>
            <ns2:transaction>
               <ns5:amount>
                  <ns4:instructedAmount currency="NOK">
                     <ns4:amount>1.00</ns4:amount>
                  </ns4:instructedAmount>
               </ns5:amount>
               <ns5:chargeBearer>DEBT</ns5:chargeBearer>
               <ns5:creditorAgent>
                  <ns4:nationalId>6001</ns4:nationalId>
                  <ns4:postalAddress>
                     <ns4:country>NO</ns4:country>
                  </ns4:postalAddress>
               </ns5:creditorAgent>
               <ns5:creditor>
                  <ns4:name>Konsert ryddere ANS.</ns4:name>
                  <ns4:postalAddress>
                     <ns4:country>NO</ns4:country>
                  </ns4:postalAddress>
               </ns5:creditor>
               <ns5:creditorAccount>
                  <ns4:identification>63450103502</ns4:identification>
               </ns5:creditorAccount>
               <ns5:confidential>false</ns5:confidential>
               <ns2:remittanceInformation>
                  <ns4:remittanceInformationStructured>
                     <ns4:creditorReferenceInformation>
                        <ns4:type>SCOR</ns4:type>
                        <ns4:reference>7901807251901190010</ns4:reference>
                     </ns4:creditorReferenceInformation>
                  </ns4:remittanceInformationStructured>
               </ns2:remittanceInformation>
            </ns2:transaction>
            <ns2:marketType>BM</ns2:marketType>
         </ns6:paymentResult>
      </ns6:PaymentCreateResponse>
   </soap:Body>
</soap:Envelope>
